updates
Signed-off-by: Lawrence Lane <llane@nvidia.com>
